# RelativeCoords

## Description
Translates a point into a coordinate system defined by 2 other points.

```pascal
FUNCTION RelativeCoords(
				pt    : VECTOR;
				begPt : VECTOR;
				endPt : VECTOR) : VECTOR;
```

```python

def vs.RelativeCoords(pt, begPt, endPt):
    return VECTOR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|VECTOR||
|begPt|VECTOR||
|endPt|VECTOR||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation